shelly-tang/YareLampGo_esp32/led_serial.cpp
uint8_t scaledBrightness(uint8_t level) {
  return (uint8_t)((g_brightness * (uint16_t)level) / 255);
}

uint8_t effectChannel(uint8_t channel) {
  uint32_t scaled = (uint32_t)channel * (uint32_t)g_brightness * (uint32_t)g_effectIntensityPercent;
  return (uint8_t)(scaled / (255UL * 100UL));
}

uint32_t effectColor(bool secondary = false) {
  return color(
      effectChannel(secondary ? g_effectSecondaryRed : g_effectRed),
      effectChannel(secondary ? g_effectSecondaryGreen : g_effectGreen),
      effectChannel(secondary ? g_effectSecondaryBlue : g_effectBlue));
}

void setPhysicalPixel(int pixelIndex, uint32_t pixelColor) {
  if (pixelIndex < 0 || pixelIndex >= LAMPGO_LED_PIXEL_COUNT) return;
  int offset = pixelIndex * 3;
  g_pixels[offset + 0] = (uint8_t)((pixelColor >> 8) & 0xFF);
  g_pixels[offset + 1] = (uint8_t)((pixelColor >> 16) & 0xFF);
  g_pixels[offset + 2] = (uint8_t)(pixelColor & 0xFF);
}

int irregularPixelIndex(int row, int col) {
  if (row < 0 || row >= kIrregularRowCount || col < 0 || col >= kIrregularMaxCols) {
    return -1;
  }
  int rowLength = kIrregularRowLengths[row];
  int leftPad = (kIrregularMaxCols - rowLength) / 2;
  int localCol = col - leftPad;
  if (localCol < 0 || localCol >= rowLength) return -1;
  return kIrregularRowStarts[row] + localCol;
}

void setMatrixPixel(int row, int col, uint32_t pixelColor) {
  int pixelIndex = irregularPixelIndex(row, col);
  if (pixelIndex >= 0) {
    setPhysicalPixel(pixelIndex, pixelColor);
  }
}

void setCombinedPixel(int row, int col, uint32_t pixelColor) {
  if (row < 0 || row >= kPanelRows || col < 0 || col >= kCombinedCols) return;
  setMatrixPixel(kPanelRows - 1 - row, kCombinedCols - 1 - col, pixelColor);
}

void fillLogicalCell(int row, int col, uint32_t pixelColor) {
  int row0 = row * kPanelRows / kPatternRows;
  int row1 = ((row + 1) * kPanelRows + kPatternRows - 1) / kPatternRows;
  int col0 = col * kCombinedCols / kPatternCols;
  int col1 = ((col + 1) * kCombinedCols + kPatternCols - 1) / kPatternCols;
  if (row1 <= row0) row1 = row0 + 1;
  if (col1 <= col0) col1 = col0 + 1;
  for (int targetRow = row0; targetRow < row1; ++targetRow) {
    for (int targetCol = col0; targetCol < col1; ++targetCol) {
      setCombinedPixel(targetRow, targetCol, pixelColor);
    }
  }
}

void drawBitmap8OnMatrix(const uint8_t bitmap[8][8], uint32_t pixelColor, int colOffset, int rowOffset = 0) {
  for (int row = 0; row < 8; ++row) {
    int shiftedRow = row + rowOffset;
    if (shiftedRow < 0 || shiftedRow >= 8) continue;
    for (int col = 0; col < 8; ++col) {
      if (bitmap[row][col] == 1) {
        fillLogicalCell(shiftedRow, col + colOffset, pixelColor);
      }
    }
  }
}

void drawBitmap8PairCell(const uint8_t bitmap[8][8], uint32_t pixelColor, int cellOffset, int rowOffset = 0) {
  for (int row = 0; row < 8; ++row) {
    int shiftedRow = row + rowOffset;
    if (shiftedRow < 0 || shiftedRow >= 8) continue;
    for (int col = 0; col < 8; ++col) {
      if (bitmap[row][col] == 1) {
        int mappedCol = (col * 6) / 8;
        fillLogicalCell(shiftedRow, mappedCol + cellOffset, pixelColor);
      }
    }
  }
}

void clearPixels() {
  memset(g_pixels, 0, sizeof(g_pixels));
}

void releaseClipLocked() {
  LedClipPlayer::close();
  g_clipActive = false;
  g_storedClipActive = false;
  g_clipId[0] = 0;
  g_clipFrameCount = 0;
  g_clipFps = 0;
  g_clipFrame = 0;
  g_clipLastFrameMs = 0;
  g_effectTemplate[0] = 0;
  g_effectVariant[0] = 0;
  snprintf(g_effectDirection, sizeof(g_effectDirection), "right");
  g_expressionLoop = true;
  g_expressionEndMs = 0;
  g_clockActive = false;
}

bool showPixelsLocked();
void renderRingFill(uint32_t pixelColor, uint32_t frame);
void drawBitmap8Pair(const uint8_t bitmap[8][8], uint32_t pixelColor, int rowOffset = 0);
void drawCombinedPattern(int patternIndex, uint32_t primaryColor, uint32_t secondaryColor = 0);

constexpr uint8_t kClockDigits[10][7] = {
    {0b111, 0b101, 0b101, 0b101, 0b101, 0b101, 0b111},
    {0b010, 0b110, 0b010, 0b010, 0b010, 0b010, 0b111},
    {0b111, 0b001, 0b001, 0b111, 0b100, 0b100, 0b111},
    {0b111, 0b001, 0b001, 0b111, 0b001, 0b001, 0b111},
    {0b101, 0b101, 0b101, 0b111, 0b001, 0b001, 0b001},
    {0b111, 0b100, 0b100, 0b111, 0b001, 0b001, 0b111},
    {0b111, 0b100, 0b100, 0b111, 0b101, 0b101, 0b111},
    {0b111, 0b001, 0b001, 0b010, 0b010, 0b010, 0b010},
    {0b111, 0b101, 0b101, 0b111, 0b101, 0b101, 0b111},
    {0b111, 0b101, 0b101, 0b111, 0b001, 0b001, 0b111},
};

uint32_t clockColor(uint8_t percent = 100) {
  uint32_t scale = (uint32_t)g_brightness * percent;
  return color(
      (uint8_t)((g_clockRed * scale) / 25500UL),
      (uint8_t)((g_clockGreen * scale) / 25500UL),
      (uint8_t)((g_clockBlue * scale) / 25500UL));
}

void drawClockDigit(int digit, int startCol, uint32_t pixelColor) {
  if (digit < 0 || digit > 9) return;
  for (int row = 0; row < 7; ++row) {
    for (int col = 0; col < 3; ++col) {
      if ((kClockDigits[digit][row] & (1 << (2 - col))) == 0) continue;
      setCombinedPixel(row + 1, startCol + col * 2, pixelColor);
      setCombinedPixel(row + 1, startCol + col * 2 + 1, pixelColor);
    }
  }
}

void renderClockOrbit(uint32_t now) {
  constexpr int kPerimeter = 2 * kCombinedCols + 2 * (kPanelRows - 2);
  int position = (int)((now / 45UL) % kPerimeter);
  int row = 0;
  int col = 0;
  if (position < kCombinedCols) {
    col = position;
  } else if ((position -= kCombinedCols) < kPanelRows - 1) {
    col = kCombinedCols - 1;
    row = position;
  } else if ((position -= kPanelRows - 1) < kCombinedCols) {
    col = kCombinedCols - 1 - position;
    row = kPanelRows - 1;
  } else {
    position -= kCombinedCols;
    col = 0;
    row = kPanelRows - 1 - position;
  }
  setCombinedPixel(row, col, clockColor());
  setCombinedPixel(row == 0 ? 1 : row == kPanelRows - 1 ? kPanelRows - 2 : row, col, clockColor(35));
}

void renderClockLocked(uint32_t now) {
  clearPixels();
  bool visible = strcmp(g_clockEffect, "blink") != 0 || ((now / 500UL) % 2U) == 0;
  if (visible) {
    uint32_t primary = clockColor();
    drawClockDigit(g_clockHour / 10, 7, primary);
    drawClockDigit(g_clockHour % 10, 15, primary);
    setCombinedPixel(3, 23, primary);
    setCombinedPixel(6, 23, primary);
    drawClockDigit(g_clockMinute / 10, 27, primary);
    drawClockDigit(g_clockMinute % 10, 35, primary);
  }
  if (strcmp(g_clockEffect, "orbit") == 0) renderClockOrbit(now);
  showPixelsLocked();
}

