shelly-tang/YareLampGo_esp32/led_serial.cpp
void drawDizzyMouthLocked(uint32_t frameIndex) {
  int phase = (int)(frameIndex % 30);
  int wave = phase <= 15 ? phase : 30 - phase;
  int cx = 25 + ((phase % 6) < 3 ? -1 : 1);
  int cy = 4;
  int halfW = 12 + (wave * 13) / 15;
  int halfH = 2 + (wave * 3) / 15;
  bool customMouth = strcmp(g_effectTemplate, "mouth") == 0;
  uint32_t white = customMouth ? effectColor(false) : color(g_brightness, g_brightness, g_brightness);
  uint32_t cyan = color(0, scaledBrightness(210), g_brightness);
  uint32_t blue = color(0, scaledBrightness(95), g_brightness);
  uint32_t pink = customMouth ? effectColor(true) : color(g_brightness, scaledBrightness(45), scaledBrightness(125));
  uint32_t deep = color(scaledBrightness(105), 0, scaledBrightness(45));
  uint32_t yellow = color(g_brightness, scaledBrightness(210), 0);

  int innerW = halfW > 4 ? halfW - 3 : halfW;
  int innerH = halfH > 2 ? halfH - 1 : halfH;
  for (int row = 0; row < kPanelRows; ++row) {
    for (int col = 0; col < kCombinedCols; ++col) {
      int dx = col - cx;
      int dy = row - cy;
      int outer = (dx * dx * 100) / (halfW * halfW) + (dy * dy * 100) / (halfH * halfH);
      int inner = (dx * dx * 100) / (innerW * innerW) + (dy * dy * 100) / (innerH * innerH);
      if (outer <= 112 && inner >= 58) {
        setCombinedPixel(row, col, row > cy + 1 ? pink : white);
      } else if (outer <= 50 && wave > 6 && row >= cy) {
        setCombinedPixel(row, col, ((col + phase) % 2) ? deep : pink);
      }
    }
  }

  int left = cx - halfW;
  int right = cx + halfW;
  for (int i = 0; i < 4; ++i) {
    uint32_t accent = (i % 2) ? cyan : blue;
    setCombinedPixel(3 + (i % 2), left - 2 + i, accent);
    setCombinedPixel(5 - (i % 2), right + 2 - i, accent);
  }
  if (wave > 5) {
    setCombinedPixel(1, left - 4, yellow);
    setCombinedPixel(2, left - 5, yellow);
    setCombinedPixel(6, right + 4, yellow);
    setCombinedPixel(7, right + 5, yellow);
  }
}

void drawGenericClipMarkerLocked(uint32_t frameIndex) {
  int phase = (int)(frameIndex % 30);
  int wave = phase <= 15 ? phase : 30 - phase;
  int halfW = 10 + (wave * 10) / 15;
  uint32_t white = color(g_brightness, g_brightness, g_brightness);
  uint32_t cyan = color(0, scaledBrightness(180), g_brightness);
  for (int col = 25 - halfW; col <= 25 + halfW; ++col) {
    setCombinedPixel(4, col, white);
    if (wave > 7) {
      setCombinedPixel(3, col, cyan);
      setCombinedPixel(5, col, cyan);
    }
  }
}

uint32_t dimColor(uint32_t pixelColor, uint8_t percent) {
  uint8_t red = (uint8_t)((pixelColor >> 16) & 0xFF);
  uint8_t green = (uint8_t)((pixelColor >> 8) & 0xFF);
  uint8_t blue = (uint8_t)(pixelColor & 0xFF);
  return color(
      (uint8_t)((red * (uint16_t)percent) / 100),
      (uint8_t)((green * (uint16_t)percent) / 100),
      (uint8_t)((blue * (uint16_t)percent) / 100));
}

void drawCodexWordLocked(uint32_t frameIndex) {
  clearPixels();

  // Two deliberate black gaps make the whole word visibly blink. The short
  // dim phase and cyan scan row give it a compact terminal/glitch character.
  uint8_t phase = (uint8_t)(frameIndex % 20);
  bool visible = phase < 6 || (phase >= 9 && phase < 16) || phase >= 18;
  if (!visible) return;

  uint8_t level = phase == 18 ? 35 : 100;
  uint32_t primary = dimColor(effectColor(false), level);
  uint32_t secondary = dimColor(effectColor(true), level);
  int scanRow = (int)(frameIndex % 7);
  constexpr int kStartCol = 7;
  constexpr int kGlyphWidth = 5;
  constexpr int kGlyphGap = 3;

  for (int glyph = 0; glyph < 5; ++glyph) {
    int glyphCol = kStartCol + glyph * (kGlyphWidth + kGlyphGap);
    for (int row = 0; row < 7; ++row) {
      uint8_t bits = kCodexGlyphRows[glyph][row];
      for (int col = 0; col < kGlyphWidth; ++col) {
        if (bits & (1U << (kGlyphWidth - 1 - col))) {
          setCombinedPixel(row + 1, glyphCol + col, row == scanRow ? secondary : primary);
        }
      }
    }
  }

  // A blinking cursor completes the command-line/Codex visual language.
  if ((phase % 10) < 5) {
    for (int row = 2; row <= 7; ++row) setCombinedPixel(row, 47, secondary);
  }
}

void renderStoredClipFrameLocked(uint32_t frameIndex) {
  clearPixels();
  if (!LedClipPlayer::readTick((uint8_t)(frameIndex % LedClipPlayer::kTickCount),
                               g_storedPackedFrame,
                               sizeof(g_storedPackedFrame))) {
    Serial.printf("[led_matrix] stored frame read failed: %s\n", LedClipPlayer::lastError());
    return;
  }

  uint32_t channelSum = 0;
  for (uint16_t pixel = 0; pixel < LedClipPlayer::kPixelCount; ++pixel) {
    uint8_t paletteIndex = LedClipPlayer::paletteIndexAt(g_storedPackedFrame, pixel);
    uint32_t raw = LedClipPlayer::paletteColor(paletteIndex);
    uint8_t red = (uint8_t)((raw >> 16) & 0xFF);
    uint8_t green = (uint8_t)((raw >> 8) & 0xFF);
    uint8_t blue = (uint8_t)(raw & 0xFF);
    red = (uint8_t)(((uint32_t)red * g_brightness * g_effectIntensityPercent) / (255UL * 100UL));
    green = (uint8_t)(((uint32_t)green * g_brightness * g_effectIntensityPercent) / (255UL * 100UL));
    blue = (uint8_t)(((uint32_t)blue * g_brightness * g_effectIntensityPercent) / (255UL * 100UL));
    channelSum += red + green + blue;
    setPhysicalPixel(pixel, color(red, green, blue));
  }
  if (channelSum > LAMPGO_LED_MAX_CHANNEL_SUM) {
    for (uint16_t pixel = 0; pixel < LedClipPlayer::kPixelCount; ++pixel) {
      int offset = pixel * 3;
      g_pixels[offset + 0] = (uint8_t)(((uint32_t)g_pixels[offset + 0] * LAMPGO_LED_MAX_CHANNEL_SUM) / channelSum);
      g_pixels[offset + 1] = (uint8_t)(((uint32_t)g_pixels[offset + 1] * LAMPGO_LED_MAX_CHANNEL_SUM) / channelSum);
      g_pixels[offset + 2] = (uint8_t)(((uint32_t)g_pixels[offset + 2] * LAMPGO_LED_MAX_CHANNEL_SUM) / channelSum);
    }
  }
  showPixelsLocked();
}

void renderClipFrameLocked(uint32_t frameIndex) {
  if (!g_clipActive || g_clipFrameCount == 0) return;
  if (g_storedClipActive) {
    renderStoredClipFrameLocked(frameIndex);
    return;
  }
  clearPixels();
  if (strcmp(g_effectTemplate, "codex") == 0) {
    drawCodexWordLocked(frameIndex);
    showPixelsLocked();
    return;
  }
  if (strcmp(g_effectTemplate, "mouth") == 0) {
    if (strcmp(g_effectVariant, "flat") == 0) {
      for (int col = 10; col <= 40; ++col) setCombinedPixel(4, col, effectColor(false));
    } else if (strcmp(g_effectVariant, "smile") == 0) {
      for (int col = 12; col <= 38; ++col) {
        int distance = abs(col - 25);
        int row = 3 + (distance * distance) / 190;
        setCombinedPixel(row, col, effectColor(false));
      }
    } else if (strcmp(g_effectVariant, "dizzy") == 0) {
      drawDizzyMouthLocked(frameIndex);
    } else {
      int pulse = 2 + (int)(frameIndex % 10 < 5 ? frameIndex % 5 : 9 - frameIndex % 10);
      int halfW = 17 + pulse;
      int halfH = 3 + pulse / 2;
      for (int row = 0; row < kPanelRows; ++row) {
        for (int col = 0; col < kCombinedCols; ++col) {
          int dx = col - 25;
          int dy = row - 4;
          int outer = (dx * dx * 100) / (halfW * halfW) + (dy * dy * 100) / (halfH * halfH);
          if (outer >= 48 && outer <= 115) setCombinedPixel(row, col, effectColor(false));
        }
      }
    }
    showPixelsLocked();
    return;
  }
  if (strcmp(g_effectTemplate, "arrow") == 0) {
    int pattern = 11;
    if (strcmp(g_effectDirection, "left") == 0) pattern = 10;
    else if (strcmp(g_effectDirection, "up") == 0) pattern = 12;
    else if (strcmp(g_effectDirection, "down") == 0) pattern = 13;
    drawCombinedPattern(pattern, effectColor(false));
    showPixelsLocked();
    return;
  }
  if (strcmp(g_effectTemplate, "heart") == 0) {
    uint8_t pulse = (frameIndex % 10) < 5 ? 100 : 65;
    uint8_t previousIntensity = g_effectIntensityPercent;
    g_effectIntensityPercent = (uint8_t)((previousIntensity * pulse) / 100);
    drawBitmap8Pair(kHeartPattern, effectColor(false));
    g_effectIntensityPercent = previousIntensity;
    showPixelsLocked();
    return;
  }
  if (strcmp(g_effectTemplate, "pulse") == 0) {
    renderRingFill(effectColor(false), frameIndex);
    showPixelsLocked();
    return;
  }
  char key[32];
  normalizeKey(g_clipId, key, sizeof(key));
  if (strcmp(key, "dizzy") == 0) {
    drawDizzyMouthLocked(frameIndex);
  } else {
    drawGenericClipMarkerLocked(frameIndex);
  }
  showPixelsLocked();
}

