shelly-tang/YareLampGo_esp32/led_serial.cpp
void giveLedLock() {
  if (g_mutex) {
    xSemaphoreGive(g_mutex);
  }
}

void recordCommand(const char *command) {
  if (command && command[0]) {
    snprintf(g_lastCommand, sizeof(g_lastCommand), "%s", command);
  }
}

}  // namespace

namespace LedSerial {

bool begin() {
  if (!g_mutex) {
    g_mutex = xSemaphoreCreateMutex();
  }

  randomSeed(esp_random());
  g_ready = true;

  if (!g_task) {
    BaseType_t taskResult = xTaskCreatePinnedToCore(
        ledTask, "led_pixels", LAMPGO_LED_TASK_STACK, nullptr, 1, &g_task, 1);
    if (taskResult != pdPASS) {
      g_task = nullptr;
      Serial.printf("[led_matrix] animation task create failed: %d\n", (int)taskResult);
    }
  }

  Serial.printf("[led_matrix] ready: driver=neopixel pin=%d pixels=%d panels=%d brightness=%d deferred=1\n",
                (int)LAMPGO_LED_PIXEL_PIN,
                (int)LAMPGO_LED_PIXEL_COUNT,
                (int)LAMPGO_LED_PANEL_COUNT,
                g_brightness);
  return true;
}

bool isReady() {
  return g_ready;
}

bool setMode(int mode) {
  bool ok = setModeLocal(mode, true, 0);
  if (ok) {
    DisplayLink::sendExpression(modeName(mode));
  }
  return ok;
}

bool setModeLocal(int mode, bool loop, uint32_t durationMs) {
  if (!g_ready || mode < 0 || mode > kMaxMode || !takeLedLock()) {
    return false;
  }

  char command[8];
  snprintf(command, sizeof(command), "m%d", mode);
  recordCommand(command);
  releaseClipLocked();
  g_mode = mode;
  g_expressionLoop = loop;
  g_expressionEndMs = !loop && durationMs > 0 ? millis() + durationMs : 0;
  resetAnimationStateLocked(millis());
  renderCurrentLocked();
  bool ok = g_lastShowOk;
  giveLedLock();

  Serial.printf("[led_matrix] mode=%d name=%s pin=%d\n", mode, modeName(mode), (int)LAMPGO_LED_PIXEL_PIN);
  return ok;
}

bool setModeName(const char *name) {
  int mode = resolveMode(name);
  if (mode < 0) {
    return false;
  }
  return setMode(mode);
}

bool setBrightness(int brightness) {
  if (!g_ready || brightness < 1 || brightness > 255 || !takeLedLock()) {
    return false;
  }

  char command[8];
  snprintf(command, sizeof(command), "b%d", brightness);
  recordCommand(command);
  g_brightness = brightness;
  if (g_clockActive) {
    renderClockLocked(millis());
  } else if (g_clipActive) {
    renderClipFrameLocked(g_clipFrame);
  } else {
    resetAnimationStateLocked(millis());
    renderCurrentLocked();
  }
  bool ok = g_lastShowOk;
  giveLedLock();

  Serial.printf("[led_matrix] brightness=%d pin=%d\n", brightness, (int)LAMPGO_LED_PIXEL_PIN);
  return ok;
}

bool playClip(const char *clipId) {
  if (!g_ready || !clipId || !clipId[0] || !takeLedLock()) {
    return false;
  }

  releaseClipLocked();
  snprintf(g_clipId, sizeof(g_clipId), "%s", clipId);
  g_clipActive = true;
  g_clipFrameCount = 30;
  g_clipFps = 10;
  g_clipFrame = 0;
  g_clipLastFrameMs = millis();
  g_expressionLoop = true;
  g_expressionEndMs = 0;
  recordCommand("clip");
  renderClipFrameLocked(0);
  bool ok = g_lastShowOk;
  giveLedLock();

  Serial.printf("[led_matrix] procedural clip=%s frames=%u fps=%u\n",
                clipId, (unsigned)g_clipFrameCount, (unsigned)g_clipFps);
  DisplayLink::sendClipPlay(clipId);
  return ok;
}

bool playEffect(const EffectConfig &config) {
  if (!g_ready || !config.effectId || !config.effectId[0] || !config.templateName || !config.templateName[0] ||
      !takeLedLock()) {
    return false;
  }
  if (strcmp(config.templateName, "mouth") != 0 && strcmp(config.templateName, "arrow") != 0 &&
      strcmp(config.templateName, "heart") != 0 && strcmp(config.templateName, "pulse") != 0 &&
      strcmp(config.templateName, "codex") != 0) {
    giveLedLock();
    return false;
  }

  releaseClipLocked();
  snprintf(g_clipId, sizeof(g_clipId), "%s", config.effectId);
  snprintf(g_effectTemplate, sizeof(g_effectTemplate), "%s", config.templateName);
  snprintf(g_effectVariant, sizeof(g_effectVariant), "%s", config.variant ? config.variant : "");
  snprintf(g_effectDirection, sizeof(g_effectDirection), "%s", config.direction ? config.direction : "right");
  g_effectRed = config.red;
  g_effectGreen = config.green;
  g_effectBlue = config.blue;
  g_effectSecondaryRed = config.secondaryRed;
  g_effectSecondaryGreen = config.secondaryGreen;
  g_effectSecondaryBlue = config.secondaryBlue;
  g_effectIntensityPercent = config.intensityPercent < 10 ? 10 :
                             (config.intensityPercent > 100 ? 100 : config.intensityPercent);
  if (config.brightness >= 1) g_brightness = config.brightness;
  g_clipActive = true;
  g_clipFps = 10;
  uint32_t durationMs = config.durationMs > 0 ? config.durationMs : 3000;
  g_clipFrameCount = (uint16_t)max((uint32_t)1, durationMs / 100UL);
  g_clipFrame = 0;
  g_clipLastFrameMs = millis();
  g_expressionLoop = config.loop;
  g_expressionEndMs = config.loop ? 0 : millis() + durationMs;
  recordCommand("effect");
  renderClipFrameLocked(0);
  bool ok = g_lastShowOk;
  giveLedLock();

  Serial.printf("[led_matrix] effect=%s template=%s loop=%d duration=%lu\n",
                config.effectId, config.templateName, config.loop ? 1 : 0, (unsigned long)durationMs);
  return ok;
}

bool playStoredEffect(const StoredEffectConfig &config) {
  if (!g_ready || !config.effectId || !config.effectId[0] || !takeLedLock()) return false;
  releaseClipLocked();
  if (!LedClipPlayer::open(config.effectId, config.colors)) {
    Serial.printf("[led_matrix] stored effect open failed id=%s error=%s\n",
                  config.effectId, LedClipPlayer::lastError());
    giveLedLock();
    return false;
  }
  snprintf(g_clipId, sizeof(g_clipId), "%s", config.effectId);
  snprintf(g_effectTemplate, sizeof(g_effectTemplate), "pixel_clip");
  g_effectIntensityPercent = config.intensityPercent < 10 ? 10 :
                             (config.intensityPercent > 100 ? 100 : config.intensityPercent);
  if (config.brightness >= 1) g_brightness = config.brightness > 96 ? 96 : config.brightness;
  g_clipActive = true;
  g_storedClipActive = true;
  g_clipFps = LedClipPlayer::kFps;
  g_clipFrameCount = LedClipPlayer::kTickCount;
  g_clipFrame = 0;
  g_clipLastFrameMs = millis();
  uint32_t durationMs = config.durationMs > 0 ? config.durationMs : 3000;
  g_expressionLoop = config.loop;
  g_expressionEndMs = config.loop ? 0 : millis() + durationMs;
  recordCommand("stored_effect");
  renderStoredClipFrameLocked(0);
  bool ok = g_lastShowOk;
  giveLedLock();
  Serial.printf("[led_matrix] stored effect=%s loop=%d bytes/frame=%u\n",
                config.effectId, config.loop ? 1 : 0, (unsigned)LedClipPlayer::kFrameBytes);
  return ok;
}

bool showClock(const ClockConfig &config) {
  if (!g_ready || config.hour > 23 || config.minute > 59 || !config.effect || !takeLedLock()) return false;
  if (strcmp(config.effect, "steady") != 0 && strcmp(config.effect, "blink") != 0 &&
      strcmp(config.effect, "orbit") != 0) {
    giveLedLock();
    return false;
  }

  releaseClipLocked();
  g_mode = 0;
  g_clockActive = true;
  g_clockHour = config.hour;
  g_clockMinute = config.minute;
  g_clockRed = config.red;
  g_clockGreen = config.green;
  g_clockBlue = config.blue;
  snprintf(g_clockEffect, sizeof(g_clockEffect), "%s", config.effect);
  if (config.brightness >= 1) g_brightness = config.brightness > 96 ? 96 : config.brightness;
  g_clockLastFrameMs = millis();
  recordCommand("clock");
  renderClockLocked(g_clockLastFrameMs);
  bool ok = g_lastShowOk;
  giveLedLock();
  Serial.printf("[led_matrix] clock=%02u:%02u effect=%s\n", g_clockHour, g_clockMinute, g_clockEffect);
  return ok;
}

bool stopClock() {
  if (!g_ready || !takeLedLock()) return false;
  bool wasActive = g_clockActive;
  g_clockActive = false;
  g_clockLastFrameMs = 0;
  if (wasActive) {
    g_mode = 0;
    recordCommand("clock_stop");
    clearPixels();
    showPixelsLocked();
  }
  bool ok = !wasActive || g_lastShowOk;
  giveLedLock();
  return ok;
}

bool stopExpression(bool syncDisplay) {
  bool ok = setModeLocal(0, true, 0);
  if (syncDisplay) DisplayLink::sendClipStop();
  return ok;
}

int resolveMode(const char *name) {
  if (!name) return -1;

  char key[32];
  normalizeKey(name, key, sizeof(key));
  if (!key[0]) return -1;

  int mode = resolveNormalizedKey(key);
  if (mode >= 0) return mode;
  if (key[0] == 'm' && key[1]) {
    return resolveNormalizedKey(key + 1);
  }
  return -1;
}

const char *modeName(int mode) {
  if (mode < 0 || mode > kMaxMode) {
    return "unknown";
  }
  return kModeNames[mode];
}

int maxMode() {
  return kMaxMode;
}

int currentMode() {
  return g_mode;
}

int currentBrightness() {
  return g_brightness;
}

uint32_t lastWriteMs() {
  return g_lastWriteMs;
}

const char *lastCommand() {
  return g_lastCommand;
}

const char *driverName() {
  return "neopixel";
}

int pixelPin() {
  return LAMPGO_LED_PIXEL_PIN;
}

int pixelCount() {
  return LAMPGO_LED_PIXEL_COUNT;
}

int panelCount() {
  return LAMPGO_LED_PANEL_COUNT;
}

bool outputOk() {
  return g_lastShowOk || g_lastWriteMs == 0;
}

bool clockActive() {
  return g_clockActive;
}

const char *clockEffect() {
  return g_clockEffect;
}

void clockTime(char *out, size_t outLen) {
  if (!out || outLen == 0) return;
  snprintf(out, outLen, "%02u:%02u", g_clockHour, g_clockMinute);
}

int txPin() {
  return -1;
}

int rxPin() {
  return -1;
}

uint32_t baudRate() {
  return 0;
}

}  // namespace LedSerial
